# Required for Bun on Homebrew installations where it is not in core.
tap "oven-sh/bun"

# Shell and terminal workflow
brew "fish"
brew "starship"
brew "zoxide"
brew "fzf"
brew "direnv"

# Modern Unix tools
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "tree"

# Development runtimes and CLIs
brew "git"
brew "gh"
brew "neovim"
brew "node"
brew "mise"
brew "bun"
brew "shellcheck"
brew "shfmt"

# Agent / LLM tools
brew "openclaw-cli"

cask "claude"
cask "codex"

# Terminal font with Nerd Font glyphs for Starship, eza icons, and prompt symbols.
cask "font-jetbrains-mono-nerd-font"
